      ******************************************************************
      * Author: EMERSON S MOTTA
      * Date: 20-10-22
      * Purpose: AMOSTRA - PRÁTICA 21 - TAREFA 01
      * Tectonics: cobc
      ******************************************************************
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. C4A01P01.
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000610     SELECT ARQUIVO-ENTRADA
000620         ASSIGN       TO  "C:/Arquivos/E1-C4A01P01.TXT"
000630         ORGANIZATION IS  LINE SEQUENTIAL.
000700     SELECT ARQUIVO-SAIDA
000800         ASSIGN       TO  "C:/Arquivos/R1-C4A01P01.TXT"
000810         ORGANIZATION IS  RELATIVE
000820         ACCESS MODE  IS  SEQUENTIAL
000830         RELATIVE KEY IS  CHAVE.
001700 DATA DIVISION.
001800 FILE SECTION.
001801 FD  ARQUIVO-ENTRADA.
001802 01  REG-ENTRADA.
001803     03  REG-ENT       PIC X(40).
001900 FD  ARQUIVO-SAIDA.
002000 01  REG-SAIDA.
002100     03  REG-SAI       PIC X(40).
002110 WORKING-STORAGE SECTION.
002111 01  CHAVE                   PIC 9(5)    BINARY.
002112 01  REGISTRO-ENTRADA.
002200     03  E-POSICAO-RANK     PIC 9(2)    VALUE ZEROS.
002300     03  E-ULTIMO-NOME      PIC X(11)   VALUE SPACES.
002310     03  E-PRIMEIRO-NOME    PIC X(13)   VALUE SPACES.
002400     03  E-CODIGO-PAISME    PIC X(3)    VALUE SPACES.
002500     03  E-TOTAL-PONTOS     PIC 9(5)    VALUE ZEROS.
002501     03  E-MOV-REL-ANTER    PIC X(4)    VALUE SPACES.
002502     03  E-PARTIDAS-JOGADAS PIC 9(2)    VALUE ZEROS.
       77  ENTRADA-LIDOS          PIC 99      VALUE ZEROS.
       77  SAIDA-GRAVADOS         PIC 99      VALUE ZEROS.
003400 PROCEDURE DIVISION.
003410 S000 SECTION.
       P000-INICIO.
003600      OPEN INPUT   ARQUIVO-ENTRADA
003601      OPEN OUTPUT  ARQUIVO-SAIDA.
       P000-EXIT.

       S010 SECTION.
003603 P010-LEITURA.
003604      READ ARQUIVO-ENTRADA INTO REGISTRO-ENTRADA
003605           AT END
                    PERFORM P999-TERMINA
                 NOT AT END
                     ADD 1 TO ENTRADA-LIDOS
                     PERFORM P050-PROCESSO
            END-READ.
       P010-EXIT.

       S050 SECTION.
003607 P050-PROCESSO.
003608      MOVE   E-POSICAO-RANK TO   CHAVE
003610      WRITE  REG-SAIDA      FROM REGISTRO-ENTRADA
            ADD 1  TO SAIDA-GRAVADOS
003611      PERFORM P010-LEITURA.
       P050-EXIT.

       S999 SECTION.
003612 P999-TERMINA.
003613      CLOSE ARQUIVO-ENTRADA
003614            ARQUIVO-SAIDA
            DISPLAY "*-----------------------------------*"
            DISPLAY "        PROGRAMA - C4A01P01"
            DISPLAY "*-----------------------------------*"
            DISPLAY "ARQ ENTRADA LIDOS..: " ENTRADA-LIDOS
            DISPLAY "ARQ SAIDA GRAVADOS.: " SAIDA-GRAVADOS
            DISPLAY "*-----------------------------------*"
003615      STOP RUN.
       P999-EXIT.
       END PROGRAM C4A01P01.
