      ******************************************************************
      * Author: EMERSON S MOTTA
      * Date: 26-03-24
      * Purpose: PROGRAMA EXEMPLO - USO DE IF SIMPLES
      * Tectonics: cobc
      ******************************************************************
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. PGM-IF.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000 01  OPE-01 PIC 9(5) VALUE 3.
000000 01  OPE-02 PIC 9(5) VALUE 6.
000000 01  OPE-03 PIC 9(5) VALUE 9.
000000 01  OPE-04 PIC 9(5) VALUE 12.
000000 01  OPE-05 PIC 9(5) VALUE 15.
000000 PROCEDURE DIVISION.
000000 S000-INICIO SECTION.
       P001-INI.
000000     DISPLAY "CONTEUDO DE OPE-01: " OPE-01
000000     DISPLAY "CONTEUDO DE OPE-02: " OPE-02
000000     DISPLAY "CONTEUDO DE OPE-03: " OPE-03
000000     DISPLAY "CONTEUDO DE OPE-04: " OPE-04
000000     DISPLAY "CONTEUDO DE OPE-05: " OPE-05
           DISPLAY " ".
       P001-EXIT.
            EXIT.
000000*
       S010-EXECUTA SECTION.
       P011-EXEC.
000000     IF OPE-01 LESS 5
000000        DISPLAY OPE-01 " MENOR QUE 5"
000000     END-IF
000000*
000000     IF OPE-02 GREATER 3
000000        DISPLAY OPE-02 " MAIOR QUE 3"
000000     END-IF
000000*
000000     IF OPE-03 NOT EQUAL 5
000000        DISPLAY OPE-03 " NAO IGUAL A 5"
000000     END-IF
000000*
000000     IF OPE-04 EQUAL 12
000000        DISPLAY OPE-04 " IGUAL A 12"
000000     END-IF
000000*
000000     IF OPE-05 EQUAL 15 AND OPE-04 EQUAL 12
000000        DISPLAY OPE-05 " IGUAL 15 E " OPE-04 " IGUAL 12"
000000     END-IF.
       P011-EXIT.
            EXIT.
000000*
       S900-FIM SECTION.
       P999-FIM.
000000     STOP RUN.
       P999-EXIT.
            EXIT.
