       IDENTIFICATION DIVISION.
000000 PROGRAM-ID. MERGE-E.
000000*----------------------------------------------------------------*
000000* EXEMPLO MERGE EXTRINSECO
000000*----------------------------------------------------------------*
000000 ENVIRONMENT DIVISION.
000000 INPUT-OUTPUT SECTION.
000000  FILE-CONTROL.
000000     SELECT ARQ-TRAB
000000         ASSIGN       TO  "C:\Arquivos\temp.txt".
000000     SELECT ARQ-ENTRADA1
000000         ASSIGN       TO  "C:\Arquivos\mergeExtrinseco1.txt"
000000         ORGANIZATION IS  LINE SEQUENTIAL.
000000     SELECT ARQ-ENTRADA2
000000         ASSIGN       TO  "C:\Arquivos\mergeExtrinseco2.txt"
000000         ORGANIZATION IS  LINE SEQUENTIAL.
000000     SELECT ARQ-SAIDA
000000         ASSIGN       TO  "C:\Arquivos\mergeExtrinseco3.TXT"
000000         ORGANIZATION IS  LINE SEQUENTIAL.
000000*
000000 DATA DIVISION.
000000 FILE SECTION.
000000*
000000 SD ARQ-TRAB.
000000 01 REG-TRABALHO.
000000    03 CHAVE-01 PIC X(3).
000000    03 FILLER   PIC X(7).
000000 FD ARQ-ENTRADA1.
000000 01 REG-ENTRADA1.
000000    03  REG-ENT1        PIC X(10).
000000 FD ARQ-ENTRADA2.
000000 01 REG-ENTRADA2.
000000    03  REG-ENT2        PIC X(10).
000000 FD ARQ-SAIDA.
000000 01 REG-SAIDA.
000000    03  REG-SAI         PIC X(10).
000000*
000000 WORKING-STORAGE SECTION.
000000 PROCEDURE DIVISION.
000000 INICIO-1.
      *     OPEN INPUT ARQ-ENTRADA1
      *     OPEN INPUT ARQ-ENTRADA2

000000     MERGE ARQ-TRAB
000000        ON DESCENDING KEY CHAVE-01
000000        USING ARQ-ENTRADA1 ARQ-ENTRADA2
000000        OUTPUT PROCEDURE IS TRATA-SAIDA
000000     GO TO TERMINA.
000000*
000000 TRATA-SAIDA SECTION.
000000     OPEN OUTPUT ARQ-SAIDA.
      *
000000 RETORNO.
000000     RETURN ARQ-TRAB
              AT END
              GO TO FECHA-SAIDA
           END-RETURN
000000     MOVE REG-TRABALHO TO REG-SAIDA
000000     WRITE REG-SAIDA
000000     DISPLAY REG-SAIDA UPON CONSOLE
000000     GO TO RETORNO.
000000 FECHA-SAIDA.
000000     CLOSE ARQ-SAIDA.
      *    CLOSE ARQ-ENTRADA1
      *    CLOSE ARQ-ENTRADA2.
000000*
000000 TERMINA SECTION.
000000     DISPLAY "FINAL DA EXECUCAO MERGE EX" UPON CONSOLE.
000000     STOP RUN.
