000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. OCCURS_G.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000 01  WS-PALAVRAS.
000000     05 PIC X(10) VALUE "AMOR".
000000     05 PIC X(10) VALUE "BOLA".
000000     05 PIC X(10) VALUE "COBOL".
000000     05 PIC X(10) VALUE "DONA".
000000     05 PIC X(10) VALUE "ELA".
000000     05 PIC X(10) VALUE "FOLHA".
000000     05 PIC X(10) VALUE "GOMA".
000000     05 PIC X(10) VALUE "HOJE".
000000     05 PIC X(10) VALUE "IDEIA".
000000     05 PIC X(10) VALUE "JUNIOR".
000000     05 PIC X(10) VALUE "KING".
000000     05 PIC X(10) VALUE "LOBO".
000000     05 PIC X(10) VALUE "MEDIA".
000000     05 PIC X(10) VALUE "NOVO".
000000     05 PIC X(10) VALUE "OVO".
000000     05 PIC X(10) VALUE "PINGO".
000000     05 PIC X(10) VALUE "QUERO".
000000     05 PIC X(10) VALUE "REVELA".
000000     05 PIC X(10) VALUE "SAPO".
000000     05 PIC X(10) VALUE "TOCO".
000000     05 PIC X(10) VALUE "UNIVERSO".
000000     05 PIC X(10) VALUE "VERSO".
000000     05 PIC X(10) VALUE "WOOD".
000000     05 PIC X(10) VALUE "XILOFONE".
000000     05 PIC X(10) VALUE "YANKE".
000000     05 PIC X(10) VALUE "ZOO".
000000     05 PIC X(10) VALUE "**ERRO**".
000000*
000000 01  TABELA-PALAVRAS REDEFINES WS-PALAVRAS.
000000     05 PALAVRA-ITEM OCCURS 27 TIMES.
000000       10 PRIMEIRA-LETRA PIC X.
000000       10 FILLER         PIC X(9).
000000*
000000 01  WS-INDICE           PIC 9(3).
000000 01  WS-LETRA-ENTRADA    PIC X.
000000 01  WS-MENSAGEM-ENTRADA PIC X(42)
000000                VALUE  "INSERIR UM CARACTER DO ALFABETO".
000000*
000000 PROCEDURE DIVISION.
000000 S000 SECTION.
       P001-INICIO.
000000*
000000     DISPLAY WS-MENSAGEM-ENTRADA UPON CONSOLE
000000     ACCEPT  WS-LETRA-ENTRADA

000000     PERFORM VARYING WS-INDICE FROM 1 BY 1
                   UNTIL WS-INDICE > 26
000000     IF WS-LETRA-ENTRADA = PRIMEIRA-LETRA(WS-INDICE)
000000        DISPLAY PALAVRA-ITEM(WS-INDICE)
              DISPLAY "ENCONTRADO NA LINHA: " WS-INDICE
000000        STOP RUN
000000     END-IF
000000     END-PERFORM
000000*
000000     DISPLAY PALAVRA-ITEM(WS-INDICE)
000000*
000000     STOP RUN.

       P001-EXIT.
            EXIT.
