      ******************************************************************
      * Author: EMERSON MOTTA
      * Date: 12-11-23.
      * Purpose: EXEMPLO COMUNICACAO ENTRE PROGRAMAS - PRINCIPAL
      ******************************************************************
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. PGM-CHAMADO59.
000000 ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
000000 INPUT-OUTPUT SECTION.
000000 FILE-CONTROL.
000000 DATA DIVISION.
000000 FILE SECTION.
000000 WORKING-STORAGE SECTION.
       01  WS-PARM.
000000     05 CAMPO-A PIC X(20) VALUE "VALOR INICIAL ".
000000 PROCEDURE DIVISION.
       S000-INICIO SECTION.
       P001-INICIO.
000000     DISPLAY "INICIO DO PROGRAMA PRINCIPAL PGM-CHAMADO59"
               UPON CONSOLE

           MOVE "EMERSON" TO CAMPO-A
           DISPLAY "PROGRAMA PRINCIPAL CONTEM: " CAMPO-A

000000     CALL "PGM-CHAMADO60" USING WS-PARM

000000     DISPLAY "VOLTEI AO PROGRAMA PRINCIPAL" UPON CONSOLE
000000     DISPLAY WS-PARM UPON CONSOLE.
       P001-INICIO-EXIT.
            EXIT.

       S900-TERMINO SECTION.
       P901-TERMINO.
000000     GOBACK.
       P901-TERMINO-EXIT.
            EXIT.
       END PROGRAM PGM-CHAMADO59.
