      ******************************************************************
      * Author: EMERSON MOTTA
      * Date: 12-11-23.
      * Purpose: EXEMPLO COMUNICACAO ENTRE PROGRAMAS - PROGRAMA CHAMADO - SUB PROGRAMA *
      * Tectonics: cobc
      ******************************************************************
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. PGM-CHAMADO60.
000000 ENVIRONMENT DIVISION.
000000 INPUT-OUTPUT SECTION.
000000 FILE-CONTROL.
000000 DATA DIVISION.
000000 FILE SECTION.
000000 WORKING-STORAGE SECTION.
000000 LINKAGE SECTION.
       01  WS-PARM.
000000     05 CAMPO-B PIC X(20).
000000 PROCEDURE DIVISION USING WS-PARM.
       S000-INICIO SECTION.
       P001-INICIO.
000000      DISPLAY "INICIO DO SUB-PROGRAMA PGM-CHAMADO60" UPON CONSOLE
000000      DISPLAY WS-PARM UPON CONSOLE

000000      MOVE "SERGIO" TO CAMPO-B.
       P001-INICIO-EXIT.
            EXIT.

       S900-TERMINO SECTION.
       P901-TERMINO.
000000      GOBACK.
       P901-TERMINO-EXIT.
            EXIT.
000000 END PROGRAM PGM-CHAMADO60.
