000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. AMOST72.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000 01  PALAVRAS.
000000     05 PIC X(10) VALUE "AMOR".
000000     05 PIC X(10) VALUE "BOLA".
000000     05 PIC X(10) VALUE "COBOL".
000000     05 PIC X(10) VALUE "DONA".
000000     05 PIC X(10) VALUE "ELA".
000000     05 PIC X(10) VALUE "FOLHA".
000000     05 PIC X(10) VALUE "GOMA".
000000     05 PIC X(10) VALUE "HOJE".
000000     05 PIC X(10) VALUE "IDEIA".
000000     05 PIC X(10) VALUE "JUNIOR".
000000     05 PIC X(10) VALUE "KING".
000000     05 PIC X(10) VALUE "LOBO".
000000     05 PIC X(10) VALUE "MEDIA".
000000     05 PIC X(10) VALUE "NOVO".
000000     05 PIC X(10) VALUE "OVO".
000000     05 PIC X(10) VALUE "PINGO".
000000     05 PIC X(10) VALUE "QUERO".
000000     05 PIC X(10) VALUE "REVELA".
000000     05 PIC X(10) VALUE "SAPO".
000000     05 PIC X(10) VALUE "TOCO".
000000     05 PIC X(10) VALUE "UNIVERSO".
000000     05 PIC X(10) VALUE "VERSO".
000000     05 PIC X(10) VALUE "WOOD".
000000     05 PIC X(10) VALUE "XILOFONE".
000000     05 PIC X(10) VALUE "YANKE".
000000     05 PIC X(10) VALUE "ZOO".
000000     05 PIC X(10) VALUE "**ERRO**".
000000*
000000 01  TABELA-PALAVRAS REDEFINES  PALAVRAS.
000000     03 PALAVRA-ITEM OCCURS 27 TIMES
                           ASCENDING KEY IS WS-CHAVE
                           INDEXED BY WS-I.
000000        05 WS-CHAVE  PIC X.
000000        05 FILLER    PIC X(9).
000000*
000000 77  LETRA-ENTRADA   PIC X.
       77  WS-MENSAGEM     PIC X(40) VALUE
                           "INSERIR UM CARACTER DO ALFABETO: ".
000000*
000000 PROCEDURE DIVISION.
000000 S001 SECTION.
000000*
000000     DISPLAY WS-MENSAGEM UPON CONSOLE.
000000*
000000     ACCEPT  LETRA-ENTRADA.
000000*
000000 S002 SECTION.
000000*
000000     SET WS-I TO 1
000000*
000000     SEARCH ALL PALAVRA-ITEM
000000            AT END
000000               DISPLAY 'NAO LOCALIZADO: ' LETRA-ENTRADA
                     UPON CONSOLE
000000               PERFORM S999
000000            WHEN WS-CHAVE(WS-I) = LETRA-ENTRADA
000000               DISPLAY 'PALAVRA: ' PALAVRA-ITEM(WS-I)
                     UPON CONSOLE
000000               PERFORM S999
           END-SEARCH.
       S999 SECTION.
000000*
