       IDENTIFICATION DIVISION.
000000 PROGRAM-ID. SORT-Intrinseco.
000000*--- EXEMPLO SORT INTRINSECO
000000*--- Nesse formato, denominado SORT Intrínseco, o processo de classificação
      *--- não altera o conteúdo do registro do arquivo.
000000 ENVIRONMENT DIVISION.
000000 INPUT-OUTPUT SECTION.
000000 FILE-CONTROL.
000000     SELECT ARQ-TRAB
                ASSIGN      TO  "C:\Arquivos\Temp.txt".
000000*         ASSIGN       TO  SORTWK01. * MAINFRAME *
000000     SELECT ARQUIVO-ENTRADA
000000         ASSIGN       TO  "C:/ARQUIVOS/sortIntrinseco.txt"
000000         ORGANIZATION IS  LINE SEQUENTIAL.
000000     SELECT ARQUIVO-SAIDA
000000         ASSIGN       TO  "C:/ARQUIVOS/classificadoI.txt"
000000         ORGANIZATION IS  LINE SEQUENTIAL.
000000*
000000 DATA DIVISION.
000000 FILE SECTION.
000000 SD  ARQ-TRAB.
000000 01  REG-TRABALHO.
000000     03 CHAVE-01 PIC X(3).
000000     03 FILLER   PIC X(7).
000000 FD  ARQUIVO-ENTRADA.
000000 01  REG-ENTRADA.
000000     03  REG-ENT         PIC X(10).
000000 FD  ARQUIVO-SAIDA.
000000 01  REG-SAIDA.
000000     03  REG-SAI         PIC X(10).
000000*
000000 WORKING-STORAGE SECTION.
000000 PROCEDURE DIVISION.
000000 INICIO-1.
000000     SORT ARQ-TRAB
000000          ON ASCENDING KEY CHAVE-01
000000          USING ARQUIVO-ENTRADA
000000          GIVING ARQUIVO-SAIDA
000000     DISPLAY "FIM DA EXECUCAO" UPON CONSOLE.
000000     STOP RUN.
