       IDENTIFICATION DIVISION.
000000 PROGRAM-ID. SORT-Extrinseco.
000000*--- EXEMPLO SORT EXTRINSECO
000000*--- Nesse formato, denominado SORT Extrínseco, pode-se alterar o lay-out
      *--- dos registros do arquivo de saída, eliminar campos na saída e até
      *--- eliminar registros na classificação, mantendo-se somente os que
      *--- interessm ao processamento.
000000 ENVIRONMENT DIVISION.
000000 INPUT-OUTPUT SECTION.
000000 FILE-CONTROL.
000000     SELECT ARQ-TRAB
                ASSIGN      TO  "C:\Arquivos\Temp.txt".
000000*         ASSIGN       TO  SORTWK01. * MAINFRAME *
000000     SELECT ARQUIVO-ENTRADA
000000         ASSIGN       TO  "C:/ARQUIVOS/sortExtrinseco.txt"
000000         ORGANIZATION IS  LINE SEQUENTIAL.
000000     SELECT ARQUIVO-SAIDA
000000         ASSIGN       TO  "C:/ARQUIVOS/classificadoE.txt"
000000         ORGANIZATION IS  LINE SEQUENTIAL.
000000*
000000 DATA DIVISION.
000000 FILE SECTION.
000000 SD  ARQ-TRAB.
000000 01  REG-TRABALHO.
000000     03 CHAVE-01         PIC X(3).
000000     03 FILLER           PIC X(7).
000000 FD  ARQUIVO-ENTRADA.
000000 01  REG-ENTRADA.
000000     03  REG-ENT         PIC X(10).
000000 FD  ARQUIVO-SAIDA.
000000 01  REG-SAIDA.
000000     03  REG-SAI         PIC X(10).
000000*
000000 WORKING-STORAGE SECTION.
000000 PROCEDURE DIVISION.
000000 INICIO-1.
000000     SORT ARQ-TRAB
000000          ON ASCENDING KEY CHAVE-01
000000          INPUT  PROCEDURE IS TRATA-ENTRADA
000000          OUTPUT PROCEDURE IS TRATA-SAIDA
000000     GO TO TERMINA.
000000*
000000 TRATA-ENTRADA SECTION.
000000     OPEN INPUT   ARQUIVO-ENTRADA.
      *
000000 LEITURA.
000000     READ ARQUIVO-ENTRADA
                AT END
                   GO TO FECHA-ENTRADA
                NOT AT END
000000            MOVE REG-ENTRADA TO REG-TRABALHO
000000              RELEASE REG-TRABALHO
                    GO TO LEITURA
           END-READ.
      *
000000 FECHA-ENTRADA.
000000     CLOSE ARQUIVO-ENTRADA.
000000*
000000 TRATA-SAIDA SECTION.
000000     OPEN OUTPUT ARQUIVO-SAIDA.
000000 RETORNO.
000000     RETURN ARQ-TRAB
                  AT END
                  GO TO FECHA-SAIDA
           END-RETURN
 00000     MOVE REG-TRABALHO TO REG-SAIDA
000000     WRITE REG-SAIDA
000000     DISPLAY REG-SAIDA UPON CONSOLE
000000     GO TO RETORNO.
000000 FECHA-SAIDA.
000000     CLOSE ARQUIVO-SAIDA.
000000*
000000 TERMINA SECTION.
000000     DISPLAY "FINAL DA EXECUCAO" UPON CONSOLE.
000000     STOP RUN.
