       01  REG-E1C3A9P1.
           03 COD-PROD  PIC 9999.
           03 FILLER    PIC X.
           03 NOME-PROD PIC X(39).
           03 VLR-PROD  PIC 9(02)V99.
           03 FILLER    PIC X.
           03 QTDE-PROD PIC 9(5).
