       01  REG-CFP001S1.
           03 ID-ALUNO           PIC 999.
           03 NM-ALUNO           PIC X(20).
           03 TL-ALUNO           PIC X(09).
