       01  WS-ENTRADA.
           03 CODIGO-ENT         PIC 9(02).
           03 SIGLA-ENT          PIC X(02).
           03 DESCRI-ENT         PIC X(06).
           03 VALOR-ENT          PIC 9(36).
