       01  REG-CFP001S2.
           03 ID-MATERIA         PIC 999.
           03 NM-MATERIA         PIC X(20).
           03 NT-APROVACAO       PIC 9(02)V99.
